espruino/Espruino/targets/nrf5x/bluetooth.c
void jsble_central_characteristicNotify(JsVar *characteristic, bool enable) {
  if (!jsble_has_central_connection())
    return bleCompleteTaskFailAndUnLock(BLETASK_CHARACTERISTIC_NOTIFY, jsvNewFromString("Not connected"));

  uint16_t cccd_handle = jsvGetIntegerAndUnLock(jsvObjectGetChild(characteristic, "handle_cccd", 0));
  if (!cccd_handle)
    return bleCompleteTaskFailAndUnLock(BLETASK_CHARACTERISTIC_NOTIFY, jsvNewFromString("handle_cccd not set"));

  uint8_t buf[BLE_CCCD_VALUE_LEN];
  buf[0] = enable ? BLE_GATT_HVX_NOTIFICATION : 0;
  buf[1] = 0;

  const ble_gattc_write_params_t write_params = {
      .write_op = BLE_GATT_OP_WRITE_REQ,
      .flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
      .handle   = cccd_handle,
      .offset   = 0,
      .len      = sizeof(buf),
      .p_value  = buf
  };

  uint32_t              err_code;
  err_code = sd_ble_gattc_write(m_central_conn_handle, &write_params);
  JsVar *errStr = jsble_get_error_string(err_code);
  if (errStr) {
    bleCompleteTaskFail(BLETASK_CHARACTERISTIC_NOTIFY, errStr);
    jsvUnLock(errStr);
  }
}

void jsble_central_startBonding(bool forceRePair) {
#if PEER_MANAGER_ENABLED
  if (!jsble_has_central_connection())
      return bleCompleteTaskFailAndUnLock(BLETASK_BONDING, jsvNewFromString("Not connected"));

  uint32_t err_code = pm_conn_secure(m_central_conn_handle, forceRePair);
  JsVar *errStr = jsble_get_error_string(err_code);
  if (errStr) {
    bleCompleteTaskFail(BLETASK_BONDING, errStr);
    jsvUnLock(errStr);
  }
#else
  return bleCompleteTaskFailAndUnLock(BLETASK_BONDING, jsvNewFromString("Peer Manager not compiled in"));
#endif
}

JsVar *jsble_central_getSecurityStatus() {
#if PEER_MANAGER_ENABLED
  if (!jsble_has_central_connection())
    return 0;
  pm_conn_sec_status_t status;

  uint32_t err_code = pm_conn_sec_status_get(m_central_conn_handle, &status);
  if (!jsble_check_error(err_code)) {
    JsVar *result = jsvNewWithFlags(JSV_OBJECT);
    if (result) {
      jsvObjectSetChildAndUnLock(result, "connected", jsvNewFromBool(status.connected));
      jsvObjectSetChildAndUnLock(result, "encrypted", jsvNewFromBool(status.encrypted));
      jsvObjectSetChildAndUnLock(result, "mitm_protected", jsvNewFromBool(status.mitm_protected));
      jsvObjectSetChildAndUnLock(result, "bonded", jsvNewFromBool(status.bonded));
    }
    return result;
  }
  return 0;
#else
  jsExceptionHere(JSET_ERROR,"Peer Manager not compiled in");
  return 0;
#endif
}

void jsble_central_setWhitelist(bool whitelist) {
#if PEER_MANAGER_ENABLED
  if (whitelist) {
    bleStatus |= BLE_WHITELIST_ON_BOND;
  } else {
    bleStatus &= ~BLE_WHITELIST_ON_BOND;
    m_whitelist_peer_cnt = 0;
    m_is_wl_changed = true;
    ble_update_whitelist();
  }
#endif
}

#endif // CENTRAL_LINK_COUNT>0

#endif // BLUETOOTH

